### Importing Libraries

In [1]:
import pandas as pd
import numpy as np
import os
import matplotlib.pyplot as plt
import seaborn as sns
import scipy

In [2]:
# Define path
path = r'C:\Users\Administrator\Desktop\DataImmersion'

In [3]:
## Importing  customer dataset
df_cust = pd.read_csv(os.path.join(path,'chapter4','Orginal data', 'customers.csv'))

In [4]:
df_cust.shape

(206209, 10)

In [5]:
df_cust.head()

,user_id,First Name,Surnam,Gender,STATE,Age,date_joined,n_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

In [6]:
df_cust.describe()

             user_id            Age   n_dependants         income
count  206209.000000  206209.000000  206209.000000  206209.000000
mean   103105.000000      49.501646       1.499823   94632.852548
std     59527.555167      18.480962       1.118433   42473.786988
min         1.000000      18.000000       0.000000   25903.000000
25%     51553.000000      33.000000       0.000000   59874.000000
50%    103105.000000      49.000000       1.000000   93547.000000
75%    154657.000000      66.000000       3.000000  124244.000000
max    206209.000000      81.000000       3.000000  593901.000000

In [7]:
##renaming the column
df_cust.rename(columns = {'First Name':'First_name','Surnam' : 'Surname','STATE': 'State','n_dependants': 'no_of_dependants','fam_status':'family_status'}, inplace = True)

In [8]:
df_cust.head()

,user_id,First_name,Surname,Gender,State,Age,date_joined,no_of_dependants,family_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

In [9]:
df_cust.dtypes

user_id              int64
First_name          object
Surname             object
Gender              object
State               object
Age                  int64
date_joined         object
no_of_dependants     int64
family_status       object
income               int64
dtype: object

In [10]:
df_cust.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 206209 entries, 0 to 206208
Data columns (total 10 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   user_id           206209 non-null  int64
 1   First_name        194950 non-null  object
 2   Surname           206209 non-null  object
 3   Gender            206209 non-null  object
 4   State             206209 non-null  object
 5   Age               206209 non-null  int64
 6   date_joined       206209 non-null  object
 7   no_of_dependants  206209 non-null  int64
 8   family_status     206209 non-null  object
 9   income            206209 non-null  int64
dtypes: int64(4), object(6)
memory usage: 15.7+ MB

### Missed Datatype

In [11]:
# testing for mixed datatype
for col in df_cust.columns.tolist():
  weird = (df_cust[[col]].applymap(type) != df_cust[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_cust[weird]) > 0:
    print (col)

First_name

In [12]:
# changing datatype
df_cust['First_name'] = df_cust['First_name'].astype('str')

In [13]:
df_cust['Surname'] = df_cust['Surname'].astype('category')

In [14]:
df_cust['Gender'] = df_cust['Gender'].astype('category')

In [15]:
df_cust['STATE'] = df_cust['State'].astype('category')

In [16]:
df_cust['family_status'] = df_cust['family_status'].astype('category')

In [17]:
df_cust['no_of_dependants'] = df_cust['no_of_dependants'].astype('int8')

In [18]:
df_cust['Age'] = df_cust['Age'].astype('int8')

In [19]:
df_cust.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 206209 entries, 0 to 206208
Data columns (total 11 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   user_id           206209 non-null  int64
 1   First_name        206209 non-null  object
 2   Surname           206209 non-null  category
 3   Gender            206209 non-null  category
 4   State             206209 non-null  object
 5   Age               206209 non-null  int8
 6   date_joined       206209 non-null  object
 7   no_of_dependants  206209 non-null  int8
 8   family_status     206209 non-null  category
 9   income            206209 non-null  int64
 10  STATE             206209 non-null  category
dtypes: category(4), int64(2), int8(2), object(3)
memory usage: 9.3+ MB

### Missing Values

In [20]:
# checking for missing value
df_cust.isnull().sum()

user_id             0
First_name          0
Surname             0
Gender              0
State               0
Age                 0
date_joined         0
no_of_dependants    0
family_status       0
income              0
STATE               0
dtype: int64

No missing values in any column.

### Duplicate Rows

In [21]:
df_dups = df_cust[df_cust.duplicated()]

In [22]:
df_dups

Empty DataFrame
Columns: [user_id, First_name, Surname, Gender, State, Age, date_joined, no_of_dependants, family_status, income, STATE]
Index: []

No duplicate rows are present.

In [23]:
## Importing  orders_products_merged dataframe
df_ords_prods_merge = pd.read_pickle(os.path.join(path,'chapter4','Prepared data', 'ords_prods_flag.pkl'))

In [24]:
df_ords_prods_merge.head()

,product_id,product_name,aisle_id,department_id,prices,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,...,price_range_loc,busiest_day,busiest_days,busiest_period_of_day,max_order,loyalty_flag,avg_price,spender_flag,order_frequency,frequency_flag
0,1,Chocolate Sandwich Cookies,61,19,5.8,3139998,138,28,6,11,...,Mid-range product,Regularly busy,Regularly busy,Most orders,32,Regular customer,6.935811,Low spender,8.0,Frequent customer
1,1,Chocolate Sandwich Cookies,61,19,5.8,1977647,138,30,6,17,...,Mid-range product,Regularly busy,Regularly busy,Most orders,32,Regular customer,6.935811,Low spender,8.0,Frequent customer
2,1,Chocolate Sandwich Cookies,61,19,5.8,389851,709,2,0,21,...,Mid-range product,Busiest day,Busiest days,Average orders,5,New customer,7.930208,Low spender,6.0,Frequent customer
3,1,Chocolate Sandwich Cookies,61,19,5.8,652770,764,1,3,13,...,Mid-range product,Regularly busy,Least busy,Most orders,3,New customer,4.972414,Low spender,9.0,Frequent customer
4,1,Chocolate Sandwich Cookies,61,19,5.8,1813452,764,3,4,17,...,Mid-range product,Least busy,Least busy,Most orders,3,New customer,4.972414,Low spender,9.0,Frequent customer

In [25]:
df_ords_prods_merge.dtypes

product_id                   int64
product_name                object
aisle_id                     int64
department_id                int64
prices                     float64
order_id                     int64
user_id                      int64
order_number                 int64
orders_day_of_week           int64
order_hour_of_day            int64
days_since_prior_order     float64
first_order                   bool
add_to_cart_order            int64
reordered                    int64
_merge                    category
price_range_loc             object
busiest_day                 object
busiest_days                object
busiest_period_of_day       object
max_order                    int64
loyalty_flag                object
avg_price                  float64
spender_flag                object
order_frequency            float64
frequency_flag              object
dtype: object

In [26]:
#removing unwanted columns
df_ords_prods_merge = df_ords_prods_merge.drop(columns = ['_merge',])

In [27]:
df_ords_prods_merge.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 32404859 entries, 0 to 32404858
Data columns (total 24 columns):
 #   Column                  Dtype
---  ------                  -----
 0   product_id              int64
 1   product_name            object
 2   aisle_id                int64
 3   department_id           int64
 4   prices                  float64
 5   order_id                int64
 6   user_id                 int64
 7   order_number            int64
 8   orders_day_of_week      int64
 9   order_hour_of_day       int64
 10  days_since_prior_order  float64
 11  first_order             bool
 12  add_to_cart_order       int64
 13  reordered               int64
 14  price_range_loc         object
 15  busiest_day             object
 16  busiest_days            object
 17  busiest_period_of_day   object
 18  max_order               int64
 19  loyalty_flag            object
 20  avg_price               float64
 21  spender_flag            object
 22  order_frequency         float64
 23  frequency_flag          object
dtypes: bool(1), float64(4), int64(11), object(8)
memory usage: 5.8+ GB

In [28]:
df_ords_prods_merge['busiest_day'] = df_ords_prods_merge['busiest_day'].astype('category')

In [29]:
df_ords_prods_merge['busiest_days'] = df_ords_prods_merge['busiest_days'].astype('category')

In [30]:
df_ords_prods_merge['price_range_loc'] = df_ords_prods_merge['price_range_loc'].astype('category')

In [31]:
df_ords_prods_merge['max_order'] = df_ords_prods_merge['max_order'].astype('int8')

In [32]:
df_ords_prods_merge['aisle_id'] = df_ords_prods_merge['aisle_id'].astype('int16')

In [33]:
df_ords_prods_merge['add_to_cart_order'] = df_ords_prods_merge['add_to_cart_order'].astype('int8')

In [34]:
df_ords_prods_merge['order_number'] = df_ords_prods_merge['order_number'].astype('int8')

In [35]:
df_ords_prods_merge['order_frequency'] = df_ords_prods_merge['order_frequency'].astype('float16')

In [36]:
df_ords_prods_merge['avg_price'] = df_ords_prods_merge['avg_price'].astype('float16')

In [37]:
df_ords_prods_merge['prices'] = df_ords_prods_merge['prices'].astype('int32')

In [38]:
df_ords_prods_merge.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 32404859 entries, 0 to 32404858
Data columns (total 24 columns):
 #   Column                  Dtype
---  ------                  -----
 0   product_id              int64
 1   product_name            object
 2   aisle_id                int16
 3   department_id           int64
 4   prices                  int32
 5   order_id                int64
 6   user_id                 int64
 7   order_number            int8
 8   orders_day_of_week      int64
 9   order_hour_of_day       int64
 10  days_since_prior_order  float64
 11  first_order             bool
 12  add_to_cart_order       int8
 13  reordered               int64
 14  price_range_loc         category
 15  busiest_day             category
 16  busiest_days            category
 17  busiest_period_of_day   object
 18  max_order               int8
 19  loyalty_flag            object
 20  avg_price               float16
 21  spender_flag            object
 22  order_frequency         float16
 23  frequency_flag          object
dtypes: bool(1), category(3), float16(2), float64(1), int16(1), int32(1), int64(7), int8(3), object(5)
memory usage: 3.9+ GB

In [39]:
# merging the files
df_ords_prods_cust = df_ords_prods_merge.merge(df_cust, on ='user_id',indicator = True)

In [40]:
df_ords_prods_cust.shape

(32404859, 35)

In [41]:
df_ords_prods_cust.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 32404859 entries, 0 to 32404858
Data columns (total 35 columns):
 #   Column                  Dtype
---  ------                  -----
 0   product_id              int64
 1   product_name            object
 2   aisle_id                int16
 3   department_id           int64
 4   prices                  int32
 5   order_id                int64
 6   user_id                 int64
 7   order_number            int8
 8   orders_day_of_week      int64
 9   order_hour_of_day       int64
 10  days_since_prior_order  float64
 11  first_order             bool
 12  add_to_cart_order       int8
 13  reordered               int64
 14  price_range_loc         category
 15  busiest_day             category
 16  busiest_days            category
 17  busiest_period_of_day   object
 18  max_order               int8
 19  loyalty_flag            object
 20  avg_price               float16
 21  spender_flag            object
 22  order_frequency         float16
 23  frequency_flag          object
 24  First_name              object
 25  Surname                 category
 26  Gender                  category
 27  State                   object
 28  Age                     int8
 29  date_joined             object
 30  no_of_dependants        int8
 31  family_status           category
 32  income                  int64
 33  STATE                   category
 34  _merge                  category
dtypes: bool(1), category(8), float16(2), float64(1), int16(1), int32(1), int64(8), int8(5), object(8)
memory usage: 5.1+ GB

In [42]:
df_ords_prods_cust['_merge'].value_counts()

both          32404859
left_only            0
right_only           0
Name: _merge, dtype: int64

In [43]:
df_ords_prods_cust.head()

,product_id,product_name,aisle_id,department_id,prices,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,...,Surname,Gender,State,Age,date_joined,no_of_dependants,family_status,income,STATE,_merge
0,1,Chocolate Sandwich Cookies,61,19,5,3139998,138,28,6,11,...,Cox,Male,Minnesota,81,8/1/2019,1,married,49620,Minnesota,both
1,1,Chocolate Sandwich Cookies,61,19,5,1977647,138,30,6,17,...,Cox,Male,Minnesota,81,8/1/2019,1,married,49620,Minnesota,both
2,907,Premium Sliced Bacon,106,12,20,3160996,138,1,5,13,...,Cox,Male,Minnesota,81,8/1/2019,1,married,49620,Minnesota,both
3,907,Premium Sliced Bacon,106,12,20,2254091,138,10,5,14,...,Cox,Male,Minnesota,81,8/1/2019,1,married,49620,Minnesota,both
4,1000,Apricots,18,10,12,505689,138,9,6,12,...,Cox,Male,Minnesota,81,8/1/2019,1,married,49620,Minnesota,both

In [44]:
# Exporting merged final data
df_ords_prods_cust.to_pickle(os.path.join(path, 'chapter4','Prepared data', 'Final_data_Task9_Part1.pkl'))